<h1>Exercise 33</h1>
<p>For every city, print the flights on a table in alphabetical order.</p>
<strong>Expected outcome:</strong>
<br>
<img src="Day-33-Expected_Output.png" width="200">

In [1]:
import os
import sqlite3
import pandas as pd

db_name="exercise33.db"
conn=sqlite3.connect(db_name)
cursor=conn.cursor()

cursor.execute("""CREATE TABLE IF NOT EXISTS players_location(name VARCHAR(20), city VARCHAR(20))""")
conn.commit()

cursor.execute("""DELETE FROM players_location""")
conn.commit()

players_data=[
    ('Sachin','Mumbai'),
    ('Virat','Delhi'),
    ('Rahul','Bangalore'),
    ('Rohit','Mumbai'),
    ('Mayank','Bangalore')
]
cursor.executemany("INSERT INTO players_location VALUES(?,?)",players_data)

querytoexec="SELECT * FROM players_location"
df=pd.read_sql(querytoexec,conn)
print(df)

     name       city
0  Sachin     Mumbai
1   Virat      Delhi
2   Rahul  Bangalore
3   Rohit     Mumbai
4  Mayank  Bangalore

In [2]:
querytoexec="SELECT MAX(CASE WHEN city = 'Bangalore' THEN name END) AS Bangalore, MAX(CASE WHEN city = 'Mumbai' THEN name END) AS Mumbai, MIN(CASE WHEN city = 'Delhi' THEN name END) AS Delhi FROM (SELECT *, row_number() OVER (PARTITION BY city ORDER BY name ASC) AS player_groups FROM players_location ) AS A GROUP BY player_groups ORDER BY player_groups"
df=pd.read_sql(querytoexec,conn)
print(df)
conn.close()

  Bangalore  Mumbai  Delhi
0    Mayank   Rohit  Virat
1     Rahul  Sachin   None